# 1. Каждое из слов «разработка», «сокет», «декоратор» представить в строковом формате и проверить тип и содержание
# соответствующих переменных. Затем с помощью онлайн-конвертера преобразовать строковые представление в формат
# Unicode и также проверить тип и содержимое переменных.

s1 = 'разработка'
s2 = 'сокет'
s3 = 'декоратор'

print(s1, type(s1))
print(s2, type(s2))
print(s3, type(s3))

un_s1 = '\u0440\u0430\u0437\u0440\u0430\u0431\u043E\u0442\u043A\u0430'
un_s2 = '\u0441\u043e\u043a\u0435\u0442'
un_s3 = '\u0434\u0435\u043a\u043e\u0440\u0430\u0442\u043e\u0440'

print(un_s1, type(un_s1))
print(un_s2, type(un_s2))
print(un_s3, type(un_s3))